[
    {
        "id":"wanted_men",
        "name":"Wanted men",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Off the main road, southeast of Deebo's Orchard, I've stumbled across a group of sketchy looking men with familiar voices. "
            },
            {
                "progress":15,
                "logText":"Off the main road, southeast of Deebo's Orchard, I've discovered the Aidem thieves hiding-out in the woods."
            },
            {
                "progress":20,
                "logText":"While speaking with Defy, I've learned the he and his men have it out for The Thieves Guild and they want to \"hit them where it really hurts\". Whatever that means. "
            },
            {
                "progress":25,
                "logText":"Defy has revealed the location of The Thieves Guild's vault of treasure - an underground storage unit accessible from the vacant house south of Fallhaven."
            },
            {
                "progress":30,
                "logText":"Defy needs the me to convince Troublemaker to let me borrow the key long enough that I can bring it back to Defy."
            },
            {
                "progress":35,
                "logText":"Defy has agreed to pay me 20 percent of the looted Thieves Guild treasure if I get the key from Troublemaker and hand it over to him."
            },
            {
                "progress":40,
                "logText":"Defy wants me to bring Troublemakers' key to him back at their new hideout located west of the Sutdover river, where the rail tracks end."
            },
            {
                "progress":45,
                "logText":"I have talked my way into acquiring the The Thieves Guild's vault key from Troublemaker, but I must return it to him quickly."
            },
            {
                "progress":50,
                "logText":"I told Troublemaker all that I knew about Defy, his men and the \"Lost Traveler\" Alaric and how they hired me to help the rob the Thieves Guild."
            },
            {
                "progress":55,
                "logText":"Troublemaker wants me help him trap Defy by providing Defy with a fake key. When Defy arrives and the secret vault, the Guild members will be waiting for him."
            }
        ]
    }
]